[
  {
    "id": 1,
    "text": {
      "zh": "耶和华是我的牧者，我必不至缺乏。",
      "en": "The LORD is my shepherd; I shall not want."
    },
    "reference": {
      "zh": "诗篇 23:1",
      "en": "Psalm 23:1"
    }
  },
  {
    "id": 2,
    "text": {
      "zh": "我靠着那加给我力量的，凡事都能做。",
      "en": "I can do all things through Christ who strengthens me."
    },
    "reference": {
      "zh": "腓立比书 4:13",
      "en": "Philippians 4:13"
    }
  },
  {
    "id": 3,
    "text": {
      "zh": "神爱世人，甚至将他的独生子赐给他们，叫一切信他的，不至灭亡，反得永生。",
      "en": "For God so loved the world that He gave His only begotten Son, that whoever believes in Him should not perish but have everlasting life."
    },
    "reference": {
      "zh": "约翰福音 3:16",
      "en": "John 3:16"
    }
  },
  {
    "id": 4,
    "text": {
      "zh": "你们要先求他的国和他的义，这些东西都要加给你们了。",
      "en": "But seek first the kingdom of God and His righteousness, and all these things shall be added to you."
    },
    "reference": {
      "zh": "马太福音 6:33",
      "en": "Matthew 6:33"
    }
  },
  {
    "id": 5,
    "text": {
      "zh": "应当一无挂虑，只要凡事借着祷告、祈求和感谢，将你们所要的告诉神。",
      "en": "Be anxious for nothing, but in everything by prayer and supplication, with thanksgiving, let your requests be made known to God."
    },
    "reference": {
      "zh": "腓立比书 4:6",
      "en": "Philippians 4:6"
    }
  },
  {
    "id": 6,
    "text": {
      "zh": "你的话是我脚前的灯，是我路上的光。",
      "en": "Your word is a lamp to my feet and a light to my path."
    },
    "reference": {
      "zh": "诗篇 119:105",
      "en": "Psalm 119:105"
    }
  },
  {
    "id": 7,
    "text": {
      "zh": "我们晓得万事都互相效力，叫爱神的人得益处，就是按他旨意被召的人。",
      "en": "And we know that all things work together for good to those who love God, to those who are the called according to His purpose."
    },
    "reference": {
      "zh": "罗马书 8:28",
      "en": "Romans 8:28"
    }
  },
  {
    "id": 8,
    "text": {
      "zh": "你们若常在我里面，我的话也常在你们里面，凡你们所愿意的，祈求就给你们成就。",
      "en": "If you abide in Me, and My words abide in you, you will ask what you desire, and it shall be done for you."
    },
    "reference": {
      "zh": "约翰福音 15:7",
      "en": "John 15:7"
    }
  },
  {
    "id": 9,
    "text": {
      "zh": "我留下平安给你们，我将我的平安赐给你们。我所赐的，不像世人所赐的。你们心里不要忧愁，也不要胆怯。",
      "en": "Peace I leave with you, My peace I give to you; not as the world gives do I give to you. Let not your heart be troubled, neither let it be afraid."
    },
    "reference": {
      "zh": "约翰福音 14:27",
      "en": "John 14:27"
    }
  },
  {
    "id": 10,
    "text": {
      "zh": "你们得救是本乎恩，也因着信；这并不是出于自己，乃是神所赐的。",
      "en": "For by grace you have been saved through faith, and that not of yourselves; it is the gift of God."
    },
    "reference": {
      "zh": "以弗所书 2:8",
      "en": "Ephesians 2:8"
    }
  },
  {
    "id": 11,
    "text": {
      "zh": "我的神必照他荣耀的丰富，在基督耶稣里使你们一切所需用的都充足。",
      "en": "And my God shall supply all your need according to His riches in glory by Christ Jesus."
    },
    "reference": {
      "zh": "腓立比书 4:19",
      "en": "Philippians 4:19"
    }
  },
  {
    "id": 12,
    "text": {
      "zh": "你们祈求，就给你们；寻找，就寻见；叩门，就给你们开门。",
      "en": "Ask, and it will be given to you; seek, and you will find; knock, and it will be opened to you."
    },
    "reference": {
      "zh": "马太福音 7:7",
      "en": "Matthew 7:7"
    }
  },
  {
    "id": 13,
    "text": {
      "zh": "耶和华是我的亮光，是我的拯救，我还怕谁呢？耶和华是我性命的保障，我还惧谁呢？",
      "en": "The LORD is my light and my salvation; Whom shall I fear? The LORD is the strength of my life; Of whom shall I be afraid?"
    },
    "reference": {
      "zh": "诗篇 27:1",
      "en": "Psalm 27:1"
    }
  },
  {
    "id": 14,
    "text": {
      "zh": "我们爱，因为神先爱我们。",
      "en": "We love Him because He first loved us."
    },
    "reference": {
      "zh": "约翰一书 4:19",
      "en": "1 John 4:19"
    }
  },
  {
    "id": 15,
    "text": {
      "zh": "你们要彼此相爱，像我爱你们一样，这就是我的命令。",
      "en": "This is My commandment, that you love one another as I have loved you."
    },
    "reference": {
      "zh": "约翰福音 15:12",
      "en": "John 15:12"
    }
  },
  {
    "id": 16,
    "text": {
      "zh": "因为神赐给我们不是胆怯的心，乃是刚强、仁爱、谨守的心。",
      "en": "For God has not given us a spirit of fear, but of power and of love and of a sound mind."
    },
    "reference": {
      "zh": "提摩太后书 1:7",
      "en": "2 Timothy 1:7"
    }
  },
  {
    "id": 17,
    "text": {
      "zh": "你们要休息，要知道我是神！我必在外邦中被尊崇，在遍地上也被尊崇。",
      "en": "Be still, and know that I am God; I will be exalted among the nations, I will be exalted in the earth!"
    },
    "reference": {
      "zh": "诗篇 46:10",
      "en": "Psalm 46:10"
    }
  },
  {
    "id": 18,
    "text": {
      "zh": "我的恩典够你用的，因为我的能力是在人的软弱上显得完全。",
      "en": "My grace is sufficient for you, for My strength is made perfect in weakness."
    },
    "reference": {
      "zh": "哥林多后书 12:9",
      "en": "2 Corinthians 12:9"
    }
  },
  {
    "id": 19,
    "text": {
      "zh": "你们若彼此相爱，众人因此就认出你们是我的门徒了。",
      "en": "By this all will know that you are My disciples, if you have love for one another."
    },
    "reference": {
      "zh": "约翰福音 13:35",
      "en": "John 13:35"
    }
  },
  {
    "id": 20,
    "text": {
      "zh": "我将你的话藏在心里，免得我得罪你。",
      "en": "Your word I have hidden in my heart, That I might not sin against You."
    },
    "reference": {
      "zh": "诗篇 119:11",
      "en": "Psalm 119:11"
    }
  }
]
