[
  {
    "id": 1,
    "title": {
      "zh": "诺亚方舟",
      "en": "Noah's Ark"
    },
    "content": {
      "zh": "在远古时代，人类的罪恶使神决定以洪水毁灭世界。但诺亚在神面前蒙恩，神指示他建造一艘大船，以拯救他的家人和各种动物。洪水来临，淹没了整个大地，只有诺亚方舟上的生命得以存活。洪水退去后，神与诺亚立约，以彩虹为记号，承诺不再以洪水毁灭世界。这个故事教导我们信心和顺服的重要性，以及神对忠心之人的保守。",
      "en": "In ancient times, human wickedness caused God to decide to destroy the world with a flood. But Noah found favor in God's eyes, and God instructed him to build a large boat to save his family and various animals. When the flood came, it covered the entire earth, and only those on Noah's ark survived. After the waters receded, God made a covenant with Noah, using the rainbow as a sign, promising never to destroy the world by flood again. This story teaches us the importance of faith and obedience, and God's protection of those who are faithful."
    },
    "reference": {
      "zh": "创世记 6-9章",
      "en": "Genesis 6-9"
    }
  },
  {
    "id": 2,
    "title": {
      "zh": "大卫与歌利亚",
      "en": "David and Goliath"
    },
    "content": {
      "zh": "以色列人与非利士人交战时，非利士巨人歌利亚每天向以色列军队挑战，要求单打独斗。没有以色列士兵敢应战，直到年轻的牧羊人大卫前来。大卫拒绝了盔甲，只带着他的投石器和五块光滑的石子，凭着对神的信心迎战。他用投石器击中了歌利亚的额头，使巨人倒地，然后用歌利亚自己的剑将他杀死。这个故事告诉我们，当我们信靠神时，即使面对看似不可能战胜的困难，也能获得胜利。",
      "en": "During a battle between the Israelites and the Philistines, the Philistine giant Goliath challenged the Israelite army to single combat daily. No Israelite soldier dared to fight until young shepherd David came forward. David refused armor, bringing only his sling and five smooth stones, facing the battle with faith in God. He struck Goliath in the forehead with his sling, causing the giant to fall, and then killed him with Goliath's own sword. This story tells us that when we trust in God, we can overcome seemingly impossible challenges."
    },
    "reference": {
      "zh": "撒母耳记上 17章",
      "en": "1 Samuel 17"
    }
  },
  {
    "id": 3,
    "title": {
      "zh": "约瑟的故事",
      "en": "The Story of Joseph"
    },
    "content": {
      "zh": "约瑟是雅各最爱的儿子，他的哥哥们因嫉妒将他卖为奴隶到埃及。在埃及，约瑟经历了从奴隶到囚犯再到宰相的奇妙旅程。当埃及和周围地区面临七年饥荒时，约瑟的智慧和神的带领使埃及有充足的粮食。他的哥哥们来埃及买粮时，约瑟选择饶恕他们，并与家人团聚。这个故事展示了神如何在逆境中与我们同在，并将恶意转化为祝福。",
      "en": "Joseph was Jacob's favorite son, and his brothers, out of jealousy, sold him as a slave to Egypt. In Egypt, Joseph experienced a remarkable journey from slave to prisoner to prime minister. When Egypt and surrounding regions faced seven years of famine, Joseph's wisdom and God's guidance ensured Egypt had abundant food. When his brothers came to Egypt to buy grain, Joseph chose to forgive them and reunite with his family. This story shows how God is with us in adversity and can turn evil intentions into blessings."
    },
    "reference": {
      "zh": "创世记 37-50章",
      "en": "Genesis 37-50"
    }
  },
  {
    "id": 4,
    "title": {
      "zh": "摩西过红海",
      "en": "Moses Crossing the Red Sea"
    },
    "content": {
      "zh": "在神的带领下，摩西引导以色列人离开埃及的奴役。法老追赶他们到红海边，以色列人前有大海、后有追兵，陷入绝境。摩西按神的指示举杖，红海分开，以色列人走在干地上过海。当埃及军队追入海中时，海水合拢，淹没了追兵。这个神迹展示了神的大能和对祂子民的保护，教导我们在看似无路可走的情况下，仍要信靠神的拯救。",
      "en": "Under God's guidance, Moses led the Israelites out of slavery in Egypt. Pharaoh pursued them to the Red Sea, where the Israelites were trapped between the sea and the pursuing army. Moses raised his staff as God instructed, and the Red Sea parted, allowing the Israelites to cross on dry ground. When the Egyptian army followed, the waters closed, drowning the pursuers. This miracle demonstrates God's power and protection of His people, teaching us to trust in God's deliverance even when there seems to be no way out."
    },
    "reference": {
      "zh": "出埃及记 14章",
      "en": "Exodus 14"
    }
  },
  {
    "id": 5,
    "title": {
      "zh": "但以理在狮子坑中",
      "en": "Daniel in the Lions' Den"
    },
    "content": {
      "zh": "但以理是被掳到巴比伦的犹太人，因才能出众被提拔为高官。嫉妒他的官员设计陷害，说服国王颁布法令，禁止向神祈祷。但以理仍然每天三次向神祷告。因违反法令，他被扔进狮子坑。神差遣天使封住狮子的口，使但以理安然无恙。次日，国王看到这奇迹，惊讶不已，将陷害者扔入狮子坑，并颁布新的法令，要求人们敬畏但以理的神。这个故事教导我们，即使面临生命危险，也要坚持信仰和对神的忠诚。",
      "en": "Daniel was a Jewish captive in Babylon who was promoted to high office due to his exceptional abilities. Officials jealous of him conspired against him, persuading the king to issue a decree forbidding prayer to any god. Daniel continued to pray to God three times daily. For violating the decree, he was thrown into a den of lions. God sent an angel to shut the lions' mouths, keeping Daniel safe. The next day, the king, amazed at this miracle, threw Daniel's accusers into the lions' den and issued a new decree requiring people to revere Daniel's God. This story teaches us to maintain our faith and loyalty to God even when facing life-threatening situations."
    },
    "reference": {
      "zh": "但以理书 6章",
      "en": "Daniel 6"
    }
  },
  {
    "id": 6,
    "title": {
      "zh": "浪子回头",
      "en": "The Prodigal Son"
    },
    "content": {
      "zh": "耶稣讲述了一个比喻：一个父亲有两个儿子，小儿子要求分家产，然后远走他乡，挥霍无度。当他花光所有钱财，又遇上饥荒时，沦落到给猪喂食的地步。他醒悟过来，决定回到父亲身边，愿意做一个仆人。然而，父亲远远看见他就跑去迎接，拥抱他，为他预备盛宴庆祝。这个比喻展示了神对悔改之人的无条件接纳和爱，无论我们曾经多么远离祂。",
      "en": "Jesus told a parable: A father had two sons, and the younger son asked for his share of the inheritance, then went to a distant country and squandered his wealth in wild living. When he had spent everything and a famine arose, he found himself feeding pigs. Coming to his senses, he decided to return to his father, willing to be a servant. However, the father saw him from afar and ran to embrace him, preparing a feast to celebrate. This parable illustrates God's unconditional acceptance and love for those who repent, no matter how far they have strayed from Him."
    },
    "reference": {
      "zh": "路加福音 15:11-32",
      "en": "Luke 15:11-32"
    }
  },
  {
    "id": 7,
    "title": {
      "zh": "好撒玛利亚人",
      "en": "The Good Samaritan"
    },
    "content": {
      "zh": "有一个人从耶路撒冷下耶利哥去，落在强盗手中，被打个半死。一个祭司和一个利未人先后路过，都绕道而行。后来一个撒玛利亚人（当时被犹太人视为敌人）经过，动了慈心，上前包扎他的伤口，把他带到客店里照顾他，并支付了额外的费用。耶稣通过这个比喻教导我们，真正的邻舍之爱超越种族、宗教和社会界限，我们应当向所有需要帮助的人施以怜悯。",
      "en": "A man was traveling from Jerusalem to Jericho when he was attacked by robbers and left half dead. A priest and a Levite passed by, both avoiding him. Later, a Samaritan (considered an enemy by Jews at that time) came by, felt compassion, bandaged his wounds, took him to an inn to care for him, and paid extra expenses. Through this parable, Jesus teaches us that true neighborly love transcends racial, religious, and social boundaries, and we should show mercy to all who need help."
    },
    "reference": {
      "zh": "路加福音 10:25-37",
      "en": "Luke 10:25-37"
    }
  },
  {
    "id": 8,
    "title": {
      "zh": "五饼二鱼",
      "en": "Five Loaves and Two Fish"
    },
    "content": {
      "zh": "耶稣在加利利海边教导众人，天色已晚，门徒建议遣散众人去买食物。耶稣却说：'你们给他们吃吧。'门徒只找到一个小孩带的五个饼和两条鱼。耶稣拿起饼和鱼，祝谢后，擘开分给众人。奇迹发生了，五千多人都吃饱了，还剩下十二篮零碎。这个神迹教导我们，当我们将有限的资源交在神手中，祂能使之倍增，满足众人的需要。",
      "en": "Jesus was teaching a crowd by the Sea of Galilee. As evening approached, the disciples suggested sending the people away to buy food. Jesus said, 'You give them something to eat.' The disciples found only five loaves of bread and two fish from a boy. Jesus took the bread and fish, gave thanks, broke them, and distributed them to the people. A miracle occurred: over five thousand people were fed, with twelve baskets of leftovers. This miracle teaches us that when we place our limited resources in God's hands, He can multiply them to meet the needs of many."
    },
    "reference": {
      "zh": "马太福音 14:13-21",
      "en": "Matthew 14:13-21"
    }
  },
  {
    "id": 9,
    "title": {
      "zh": "耶稣平静风浪",
      "en": "Jesus Calms the Storm"
    },
    "content": {
      "zh": "耶稣和门徒乘船渡加利利海时，忽然起了暴风，波浪打入船内，船几乎满了水。耶稣却在船尾睡觉。门徒惊慌地叫醒祂：'老师，我们丧命，你不顾吗？'耶稣起来，斥责风和海：'住了吧！静了吧！'风就止住，大大平静了。耶稣对门徒说：'为什么胆怯？你们还没有信心吗？'这个神迹显明耶稣对自然的权柄，也教导我们在人生风浪中信靠祂的重要性。",
      "en": "Jesus and His disciples were crossing the Sea of Galilee by boat when a violent storm arose, with waves breaking into the boat, nearly swamping it. Jesus was sleeping at the stern. The disciples woke Him in panic: 'Teacher, don't you care if we drown?' Jesus got up, rebuked the wind and said to the waves, 'Quiet! Be still!' The wind ceased, and there was a great calm. Jesus said to His disciples, 'Why are you so afraid? Do you still have no faith?' This miracle reveals Jesus' authority over nature and teaches us the importance of trusting Him during the storms of life."
    },
    "reference": {
      "zh": "马可福音 4:35-41",
      "en": "Mark 4:35-41"
    }
  },
  {
    "id": 10,
    "title": {
      "zh": "约拿与大鱼",
      "en": "Jonah and the Great Fish"
    },
    "content": {
      "zh": "神呼召约拿去尼尼微城宣告审判，但约拿不愿去，就坐船逃往他施。神使海中起大风浪，船几乎破裂。水手发现约拿是原因，就按他的要求将他抛入海中。神安排一条大鱼吞下约拿，他在鱼腹中三日三夜，向神祷告悔改。之后，鱼将他吐在陆地上。约拿去尼尼微传讲神的信息，全城悔改，神就不降灾祸。这个故事教导我们，无法逃避神的呼召，神的怜悯和赦免临到所有悔改的人。",
      "en": "God called Jonah to proclaim judgment to the city of Nineveh, but Jonah was unwilling and fled by ship to Tarshish. God sent a great storm, and the ship was in danger of breaking up. The sailors discovered Jonah was the cause and, at his request, threw him into the sea. God appointed a great fish to swallow Jonah, and he remained in its belly for three days and three nights, praying to God in repentance. Afterward, the fish vomited Jonah onto dry land. Jonah went to Nineveh and delivered God's message, and the entire city repented, so God withheld disaster. This story teaches us that we cannot escape God's call, and God's mercy and forgiveness extend to all who repent."
    },
    "reference": {
      "zh": "约拿书 1-4章",
      "en": "Jonah 1-4"
    }
  },
  {
    "id": 11,
    "title": {
      "zh": "耶稣医治瘫子",
      "en": "Jesus Heals the Paralytic"
    },
    "content": {
      "zh": "有一天，耶稣在一个房子里教导人，人群挤满了门前。四个人抬着一个瘫子来见耶稣，因为人多，他们就拆了房顶，把瘫子连所躺卧的褥子缒下来到耶稣面前。耶稣见他们的信心，就对瘫子说：'小子，你的罪赦了。'有几个文士心里议论说这是亵渎。耶稣知道他们的心意，就说：'或对瘫子说你的罪赦了，或说起来，拿你的褥子行走，哪一样容易呢？'为要让他们知道人子有赦罪的权柄，耶稣对瘫子说：'起来，拿你的褥子回家去吧！'那人就起来，拿着褥子，当众人面前出去了。众人都惊奇，归荣耀与神。这个故事展示了耶稣赦罪和医治的权柄，以及信心的力量。",
      "en": "One day, Jesus was teaching in a house, and the crowd was so large that it filled the doorway. Four men carrying a paralyzed man tried to bring him to Jesus, but because of the crowd, they made an opening in the roof and lowered the man on his mat in front of Jesus. Seeing their faith, Jesus said to the paralytic, 'Son, your sins are forgiven.' Some teachers of the law thought this was blasphemy. Jesus, knowing their thoughts, said, 'Which is easier: to say to this paralyzed man, 'Your sins are forgiven,' or to say, 'Get up, take your mat and walk'?' To show that the Son of Man had authority to forgive sins, Jesus said to the paralytic, 'Get up, take your mat and go home.' The man got up, took his mat, and walked out in full view of them all. Everyone was amazed and praised God. This story demonstrates Jesus' authority to forgive sins and heal, as well as the power of faith."
    },
    "reference": {
      "zh": "马可福音 2:1-12",
      "en": "Mark 2:1-12"
    }
  },
  {
    "id": 12,
    "title": {
      "zh": "撒种的比喻",
      "en": "The Parable of the Sower"
    },
    "content": {
      "zh": "耶稣讲述了一个农夫撒种的比喻：种子落在四种不同的地方。落在路旁的，被飞鸟吃掉；落在石头地上的，因土浅根不深，太阳出来就枯干；落在荆棘里的，被荆棘挤住不能结实；落在好土里的，结出三十倍、六十倍、一百倍的果实。耶稣解释说，种子是神的道，四种地方代表人心对神话语的不同回应。这个比喻教导我们，要成为好土，让神的话语在我们生命中结出丰盛的果实。",
      "en": "Jesus told a parable about a farmer sowing seeds: The seeds fell on four different types of ground. Seeds that fell on the path were eaten by birds; seeds that fell on rocky places sprang up quickly but withered under the sun because they had no deep roots; seeds that fell among thorns were choked by the thorns and could not bear fruit; seeds that fell on good soil produced a crop—thirty, sixty, or a hundred times what was sown. Jesus explained that the seed is the word of God, and the four types of ground represent different responses of the human heart to God's word. This parable teaches us to be like good soil, allowing God's word to produce abundant fruit in our lives."
    },
    "reference": {
      "zh": "马太福音 13:1-23",
      "en": "Matthew 13:1-23"
    }
  },
  {
    "id": 13,
    "title": {
      "zh": "耶稣复活拉撒路",
      "en": "Jesus Raises Lazarus"
    },
    "content": {
      "zh": "拉撒路病重，他的姐妹马大和马利亚派人去告诉耶稣。耶稣却延迟两天才出发，到达时拉撒路已死去四天。马大对耶稣说：'主啊，你若早在这里，我兄弟必不死。'耶稣说：'复活在我，生命也在我。信我的人虽然死了，也必复活。'来到坟墓前，耶稣哭了，然后大声呼叫：'拉撒路，出来！'死人就裹着裹尸布出来了。这个神迹显明耶稣胜过死亡的权柄，坚固了许多人的信心。",
      "en": "Lazarus was seriously ill, and his sisters Martha and Mary sent word to Jesus. Jesus delayed His departure for two days, and by the time He arrived, Lazarus had been dead for four days. Martha said to Jesus, 'Lord, if you had been here, my brother would not have died.' Jesus said, 'I am the resurrection and the life. The one who believes in me will live, even though they die.' At the tomb, Jesus wept, then called in a loud voice, 'Lazarus, come out!' The dead man came out, still wrapped in burial cloths. This miracle demonstrates Jesus' power over death and strengthened the faith of many."
    },
    "reference": {
      "zh": "约翰福音 11:1-44",
      "en": "John 11:1-44"
    }
  },
  {
    "id": 14,
    "title": {
      "zh": "保罗的归信",
      "en": "Paul's Conversion"
    },
    "content": {
      "zh": "扫罗（后改名保罗）原是逼迫基督徒的法利赛人。他正前往大马士革捉拿信徒时，忽然有大光从天上四面照着他，他仆倒在地，听见有声音说：'扫罗，扫罗，你为什么逼迫我？'他问：'主啊，你是谁？'主说：'我就是你所逼迫的耶稣。'扫罗三天不能看见，不吃不喝。神差遣亚拿尼亚为他祷告，他的眼睛复明，受了洗，成为传扬基督的使徒。这个故事展示了神改变生命的大能，即使是最顽固的反对者也能成为祂的器皿。",
      "en": "Saul (later renamed Paul) was a Pharisee who persecuted Christians. While traveling to Damascus to arrest believers, suddenly a light from heaven flashed around him. He fell to the ground and heard a voice saying, 'Saul, Saul, why do you persecute me?' He asked, 'Who are you, Lord?' The voice replied, 'I am Jesus, whom you are persecuting.' Saul was blind for three days and did not eat or drink. God sent Ananias to pray for him, and his sight was restored. He was baptized and became an apostle proclaiming Christ. This story demonstrates God's power to transform lives, showing that even the most stubborn opponents can become His instruments."
    },
    "reference": {
      "zh": "使徒行传 9:1-19",
      "en": "Acts 9:1-19"
    }
  },
  {
    "id": 15,
    "title": {
      "zh": "耶稣受试探",
      "en": "The Temptation of Jesus"
    },
    "content": {
      "zh": "耶稣受洗后，被圣灵引到旷野，禁食四十昼夜，后来就饿了。魔鬼来试探祂，首先挑战祂将石头变成食物，耶稣回答说人活着不是单靠食物，乃是靠神口里所出的一切话。然后魔鬼带祂到圣殿顶，要祂跳下去测试神的保护，耶稣回答说不可试探主你的神。最后魔鬼带祂到高山，应许将万国给祂，只要祂俯伏拜魔鬼，耶稣斥责说当拜主你的神，单要事奉祂。魔鬼离开后，有天使来伺候祂。这个故事教导我们如何用神的话语抵挡试探。",
      "en": "After His baptism, Jesus was led by the Spirit into the wilderness, where He fasted for forty days and nights and became hungry. The devil came to tempt Him, first challenging Him to turn stones into bread. Jesus replied that man does not live on bread alone, but on every word that comes from God's mouth. Then the devil took Him to the highest point of the temple, asking Him to jump to test God's protection. Jesus answered that we should not put the Lord our God to the test. Finally, the devil took Him to a high mountain, promising Him all the kingdoms of the world if He would bow down and worship the devil. Jesus rebuked him, saying to worship the Lord your God and serve Him only. After the devil left, angels came and attended to Him. This story teaches us how to use God's word to resist temptation."
    },
    "reference": {
      "zh": "马太福音 4:1-11",
      "en": "Matthew 4:1-11"
    }
  },
  {
    "id": 16,
    "title": {
      "zh": "以利亚与巴力先知",
      "en": "Elijah and the Prophets of Baal"
    },
    "content": {
      "zh": "在亚哈王统治以色列期间，人民陷入拜巴力的偶像崇拜中。先知以利亚向亚哈王挑战，召集450个巴力先知在迦密山上决一胜负。他们各自预备一只公牛，放在柴上，不点火。巴力先知从早到晚呼求巴力降火，却毫无回应。以利亚修好耶和华的坛，将水倒在祭物和柴上三次，然后祷告。耶和华的火降下，烧尽燔祭和柴，又烧干沟里的水。百姓俯伏敬拜，承认耶和华是神。这个故事彰显了真神的大能，以及一个人靠信心站立的力量。",
      "en": "During King Ahab's reign in Israel, the people fell into idolatrous worship of Baal. The prophet Elijah challenged King Ahab, gathering 450 prophets of Baal on Mount Carmel for a showdown. Each side prepared a bull on wood without lighting a fire. The prophets of Baal called on their god from morning until evening, but there was no response. Elijah repaired the altar of the Lord, poured water on the sacrifice and wood three times, then prayed. The fire of the Lord fell and consumed the burnt offering, the wood, and even licked up the water in the trench. The people fell prostrate and acknowledged that the Lord is God. This story demonstrates the power of the true God and the strength of one person standing in faith."
    },
    "reference": {
      "zh": "列王纪上 18:20-40",
      "en": "1 Kings 18:20-40"
    }
  },
  {
    "id": 17,
    "title": {
      "zh": "约书亚和耶利哥城",
      "en": "Joshua and Jericho"
    },
    "content": {
      "zh": "以色列人进入应许之地后，面临坚固的耶利哥城。神指示约书亚率领军队绕城一周，一天一次，持续六天；第七天绕城七次，然后祭司吹角，百姓大声呼喊。他们遵照神的指示行，当他们呼喊时，城墙塌陷，以色列人攻取了城。这个故事教导我们，胜利不是靠人的力量和策略，而是靠顺服神的指示和信靠祂的大能。",
      "en": "After the Israelites entered the Promised Land, they faced the fortified city of Jericho. God instructed Joshua to lead the army around the city once a day for six days; on the seventh day, they were to march around it seven times, then the priests would blow trumpets and the people would shout. They followed God's instructions, and when they shouted, the walls collapsed, allowing the Israelites to capture the city. This story teaches us that victory comes not through human strength and strategy, but through obedience to God's instructions and trust in His power."
    },
    "reference": {
      "zh": "约书亚记 6章",
      "en": "Joshua 6"
    }
  },
  {
    "id": 18,
    "title": {
      "zh": "路得的忠诚",
      "en": "Ruth's Loyalty"
    },
    "content": {
      "zh": "在士师时代，以色列发生饥荒，拿俄米和丈夫带着两个儿子去摩押地寄居。丈夫和儿子们都死了，只剩下拿俄米和两个摩押媳妇。拿俄米决定回以色列，劝媳妇留在本地。一个媳妇回去了，但路得坚持跟随，说：'你往哪里去，我也往那里去；你在哪里住宿，我也在那里住宿；你的国就是我的国，你的神就是我的神。'回到伯利恒后，路得在波阿斯的田里拾穗养活婆婆。波阿斯被她的品德所感动，最终娶她为妻。他们的后代中有大卫王，也是耶稣的祖先。这个故事展示了忠诚、信心和神的眷顾。",
      "en": "During the time of the judges, a famine occurred in Israel, and Naomi, her husband, and their two sons went to live in Moab. After her husband and sons died, only Naomi and her two Moabite daughters-in-law remained. Naomi decided to return to Israel and urged her daughters-in-law to stay in their homeland. One returned, but Ruth insisted on following Naomi, saying, 'Where you go I will go, and where you stay I will stay. Your people will be my people and your God my God.' Back in Bethlehem, Ruth gleaned in Boaz's field to support her mother-in-law. Boaz was moved by her character and eventually married her. Their descendants included King David and, later, Jesus. This story demonstrates loyalty, faith, and God's providence."
    },
    "reference": {
      "zh": "路得记 1-4章",
      "en": "Ruth 1-4"
    }
  },
  {
    "id": 19,
    "title": {
      "zh": "以斯帖拯救犹太人",
      "en": "Esther Saves the Jews"
    },
    "content": {
      "zh": "波斯王亚哈随鲁的宰相哈曼设计陷害犹太人，获得王的诏书，计划在某一天杀灭所有犹太人。犹太女子以斯帖通过选美成为王后，但王不知她的身份。她的养父末底改鼓励她利用王后身份拯救同胞：'焉知你得了王后的位分不是为现今的机会吗？'以斯帖冒死进见王，巧妙地揭露哈曼的阴谋。王大怒，将哈曼处死，并允许犹太人自卫。犹太人因此得救，设立普珥节纪念这一事件。这个故事教导我们，神会使用各样的人和环境成就祂的旨意，我们应当勇敢地承担责任。",
      "en": "Haman, the vizier of King Ahasuerus of Persia, plotted against the Jews and obtained a royal decree to destroy all Jews on a specific day. Esther, a Jewish woman who had become queen through a beauty contest, kept her identity secret from the king. Her foster father Mordecai encouraged her to use her position as queen to save her people: 'Who knows but that you have come to your royal position for such a time as this?' Esther risked her life by approaching the king uninvited and cleverly exposed Haman's plot. The king was furious, had Haman executed, and allowed the Jews to defend themselves. The Jews were saved and established the festival of Purim to commemorate this event. This story teaches us that God uses various people and circumstances to accomplish His purposes, and we should courageously take responsibility."
    },
    "reference": {
      "zh": "以斯帖记 1-10章",
      "en": "Esther 1-10"
    }
  },
  {
    "id": 20,
    "title": {
      "zh": "耶稣与撒玛利亚妇人",
      "en": "Jesus and the Samaritan Woman"
    },
    "content": {
      "zh": "耶稣经过撒玛利亚，在叙加城雅各井旁休息。一个撒玛利亚妇人来打水，耶稣向她要水喝，打破了犹太人与撒玛利亚人不相往来的传统。耶稣告诉她关于活水的奥秘，并道出她有过五个丈夫的隐私。妇人认出祂是先知，讨论敬拜的地点。耶稣启示说，真正的敬拜不在乎地点，而在乎心灵和诚实。妇人相信耶稣是弥赛亚，回城向众人作见证，许多人因此信了耶稣。这个故事展示了耶稣跨越文化和社会障碍的爱，以及祂对个人的关注和救赎。",
      "en": "Jesus traveled through Samaria and rested by Jacob's well in the town of Sychar. A Samaritan woman came to draw water, and Jesus asked her for a drink, breaking the tradition of non-association between Jews and Samaritans. Jesus told her about the mystery of living water and revealed her private life of having had five husbands. The woman recognized Him as a prophet and discussed the location of worship. Jesus revealed that true worship is not about location but in spirit and truth. The woman believed Jesus was the Messiah, returned to town to testify to others, and many believed in Jesus because of her testimony. This story demonstrates Jesus' love that crosses cultural and social barriers, as well as His personal attention and redemption."
    },
    "reference": {
      "zh": "约翰福音 4:1-42",
      "en": "John 4:1-42"
    }
  }
]
