[
  {
    "id": 1,
    "title": {
      "zh": "诺亚方舟",
      "en": "Noah's Ark"
    },
    "content": {
      "zh": "在远古时代，人类的罪恶在地上泛滥，神决定用洪水审判世界。然而，诺亚在神面前是个义人，蒙了恩典。神指示他建造一艘巨大的方舟，并带上他的家人和各类动物的代表。当洪水淹没大地时，方舟里的生命得以存活。洪水退去后，神与诺亚并所有活物立下永约，以彩虹为记号，承诺永不再用洪水毁灭世界。这个故事深刻地教导我们，信心与顺服是在神面前蒙恩的关键，并彰显了神对忠于祂的人那信实的保守与应许。",
      "en": "In ancient times, human wickedness proliferated on the earth, and God decided to judge the world with a flood. However, Noah was a righteous man who found favor in God's eyes. God instructed him to build a massive ark and to take his family and representatives of every kind of animal with him. When the floodwaters covered the earth, all life within the ark was saved. After the waters receded, God established an everlasting covenant with Noah and all living creatures, setting the rainbow as a sign of His promise never again to destroy the world by a flood. This story profoundly teaches that faith and obedience are key to finding favor before God, and it demonstrates His faithful protection and promise to those who are loyal to Him."
    },
    "reference": {
      "zh": "创世记 6-9章",
      "en": "Genesis 6-9"
    }
  },
  {
    "id": 2,
    "title": {
      "zh": "大卫与歌利亚",
      "en": "David and Goliath"
    },
    "content": {
      "zh": "在以色列人与非利士人对峙的战场上，非利士的巨人歌利亚日复一日地向以色列军队发出挑战，令所有士兵胆寒。无人敢应战，直到年轻的牧羊人大卫出现。他拒绝了扫罗王赐予的战甲，只信靠神的大能，带着牧羊的机弦和五块光滑的石子走上战场。大卫凭着信心甩出石子，精准地击中歌利亚的额头，巨人应声倒地。大卫随即用歌利亚自己的刀结束了他的性命。这个故事有力地证明，胜利不在于装备的精良，而在于对神坚定不移的信靠。当我们倚靠神时，足以战胜任何看似无法逾越的巨人。",
      "en": "On the battlefield where the Israelites faced the Philistines, the Philistine giant Goliath challenged the Israelite army day after day, striking fear into the hearts of all the soldiers. No one dared to accept the challenge until the young shepherd David appeared. He refused the armor offered by King Saul, trusting only in God's power, and went into battle with his shepherd's sling and five smooth stones. With a single act of faith, David slung a stone that accurately struck Goliath's forehead, and the giant fell to the ground. David then used Goliath's own sword to end his life. This story powerfully demonstrates that victory lies not in superior equipment but in unwavering trust in God. When we rely on Him, we can conquer any seemingly insurmountable giant."
    },
    "reference": {
      "zh": "撒母耳记上 17章",
      "en": "1 Samuel 17"
    }
  },
  {
    "id": 3,
    "title": {
      "zh": "约瑟的故事",
      "en": "The Story of Joseph"
    },
    "content": {
      "zh": "约瑟是雅各最宠爱的儿子，他的哥哥们出于嫉妒，将他卖到埃及为奴。在埃及，约瑟历经坎坷，从奴隶到囚犯，最终因着神的同在和智慧，一跃成为埃及的宰相。当一场大饥荒席卷那地时，约瑟卓越的管理使埃及得以幸免。他的哥哥们前来埃及求粮时，约瑟选择了饶恕，并与全家团聚，实现了神拯救以色列家族的计划。这个故事深刻地展示了神如何在逆境中掌权，并将人的恶意转变为祂美好的祝福。",
      "en": "Joseph was Jacob's most beloved son. His brothers, driven by jealousy, sold him into slavery in Egypt. In Egypt, Joseph endured many hardships, from being a slave to a prisoner, but ultimately, through God's presence and wisdom, he rose to become the prime minister of Egypt. When a great famine swept the land, Joseph's brilliant administration saved Egypt. When his brothers came to Egypt seeking grain, Joseph chose to forgive them and reunited with his entire family, fulfilling God's plan to save the family of Israel. This story profoundly shows how God remains sovereign in adversity and turns human evil into His beautiful blessing."
    },
    "reference": {
      "zh": "创世记 37-50章",
      "en": "Genesis 37-50"
    }
  },
  {
    "id": 4,
    "title": {
      "zh": "摩西过红海",
      "en": "Moses Crossing the Red Sea"
    },
    "content": {
      "zh": "在神的带领下，摩西引领以色列人摆脱埃及的奴役。当法老的军队追至红海边时，以色列人前有汪洋，后有追兵，陷入绝境。摩西遵从神的指示向海举杖，红海便分开，以色列人走在干地上安然渡过。当埃及军队试图追赶时，海水合拢，将他们全部淹没。这个伟大的神迹彰显了神无与伦比的大能和对祂子民的奇妙拯救，教导我们在看似无路可走时，仍要全心信靠神的拯救。",
      "en": "Under God's guidance, Moses led the Israelites out of slavery in Egypt. When Pharaoh's army pursued them to the shore of the Red Sea, the Israelites were trapped, with the sea before them and the army behind them. Following God's command, Moses stretched out his staff over the sea, and the waters parted, allowing the Israelites to cross safely on dry ground. When the Egyptian army tried to follow, the waters closed in on them, drowning them all. This great miracle demonstrates God's unparalleled power and His wondrous deliverance of His people, teaching us to trust in His salvation completely, even when all paths seem to be closed."
    },
    "reference": {
      "zh": "出埃及记 14章",
      "en": "Exodus 14"
    }
  },
  {
    "id": 5,
    "title": {
      "zh": "但以理在狮子坑中",
      "en": "Daniel in the Lions' Den"
    },
    "content": {
      "zh": "但以理是被掳到巴比伦的犹太人，因其卓越的才能与品德而身居高位。心生嫉妒的同僚设计陷害他，怂恿国王颁布一道禁令：三十天内，凡向神或人求告者，必被扔进狮子坑。但以理无视禁令，仍一日三次向神祷告。因此，他被投入狮子坑中。然而，神差遣使者封住了狮子的口，使但以理毫发无伤。次日，国王目睹此神迹，震惊不已，下令将陷害者投入坑中，并宣告天下，要敬畏但以理的神。这个故事教导我们，即使面对生死威胁，也要坚守对神的忠诚与信靠。",
      "en": "Daniel, a Jewish exile in Babylon, rose to a high position due to his exceptional talent and integrity. Jealous colleagues conspired against him, persuading the king to issue a decree that for thirty days, anyone who prayed to any god or man would be thrown into the lions' den. Daniel ignored the decree and continued to pray to God three times a day. As a result, he was cast into the den of lions. However, God sent an angel to shut the lions' mouths, and Daniel remained unharmed. The next day, the king witnessed this miracle with astonishment, ordered the conspirators to be thrown into the den, and decreed that the God of Daniel should be revered throughout the kingdom. This story teaches us to remain steadfast in our loyalty and faith in God, even in the face of mortal danger."
    },
    "reference": {
      "zh": "但以理书 6章",
      "en": "Daniel 6"
    }
  },
  {
    "id": 6,
    "title": {
      "zh": "浪子回头",
      "en": "The Prodigal Son"
    },
    "content": {
      "zh": "耶稣讲述了一个感人至深的比喻：一位父亲的小儿子要求分得家产，远走他乡，生活放荡，挥霍一空。当他穷困潦倒，甚至沦落到与猪争食时，他幡然醒悟，决定回家向父亲认罪，只求作一个雇工。然而，父亲远远看见他，就动了慈心，跑去拥抱他，并为他穿上华服，预备盛宴庆祝他的归来。这个比喻生动地描绘了天父上帝的慈爱与饶恕，祂永远期盼并接纳每一个真心悔改归向祂的儿女。",
      "en": "Jesus told a deeply moving parable: the younger son of a father demanded his inheritance, traveled to a distant country, and wasted it all in wild living. When he was destitute and so desperate that he longed to eat the pigs' food, he came to his senses. He decided to return home, confess to his father, and ask to be treated as a hired servant. However, while he was still a long way off, his father saw him and was filled with compassion. He ran to his son, embraced him, clothed him in the best robe, and prepared a feast to celebrate his return. This parable vividly illustrates the love and forgiveness of God the Father, who always awaits and welcomes every child who sincerely repents and returns to Him."
    },
    "reference": {
      "zh": "路加福音 15:11-32",
      "en": "Luke 15:11-32"
    }
  },
  {
    "id": 7,
    "title": {
      "zh": "好撒玛利亚人",
      "en": "The Good Samaritan"
    },
    "content": {
      "zh": "为阐明“谁是我的邻舍”，耶稣讲了一个比喻：一个犹太人落在强盗手中，被打得半死。一位祭司和一位利未人（均为犹太宗教领袖）路过，都选择视而不见。随后，一位被犹太人轻视的撒玛利亚人经过，他动了慈心，上前用油和酒为伤者处理伤口，将他扶上自己的牲口，带到客店悉心照料，并预付了所有费用。耶稣借此教导我们，真正的爱邻舍是超越种族与社会隔阂的无私怜悯，我们应当向每一个有需要的人伸出援手。",
      "en": "To answer the question 'Who is my neighbor?', Jesus told a parable: A Jewish man was attacked by robbers and left half-dead. A priest and a Levite (both Jewish religious leaders) passed by but chose to ignore him. Then, a Samaritan, who was despised by the Jews, came upon him. He took pity on him, bandaged his wounds with oil and wine, put him on his own animal, took him to an inn to care for him, and paid for all his expenses. Through this, Jesus taught that true neighborly love is selfless compassion that transcends racial and social barriers, and that we should extend help to everyone in need."
    },
    "reference": {
      "zh": "路加福音 10:25-37",
      "en": "Luke 10:25-37"
    }
  },
  {
    "id": 8,
    "title": {
      "zh": "五饼二鱼",
      "en": "Five Loaves and Two Fish"
    },
    "content": {
      "zh": "耶稣在野地教导成千上万的民众，天色已晚，众人饥饿。门徒提议遣散众人，但耶稣却说：'你们给他们吃吧。'他们只找到一个孩童奉献的五个大麦饼和两条鱼。耶稣接过这微薄的食物，望天祝福，擘开递给门徒分发。奇迹发生了，五千多名男子（不计妇女儿童）都吃饱了，剩下的零碎还装满了十二个篮子。这个神迹教导我们，当我们甘心将自己有限的资源交在主手中时，祂能行奇事，使之倍增，满足超乎我们所想的需要。",
      "en": "Jesus was teaching a crowd of thousands in a remote place. As it grew late and the people were hungry, the disciples suggested sending them away. But Jesus said, 'You give them something to eat.' All they could find was a boy's offering of five barley loaves and two fish. Jesus took this meager meal, looked up to heaven, gave thanks, broke it, and gave it to the disciples to distribute. A miracle happened: more than five thousand men (not counting women and children) ate and were satisfied, and the leftovers filled twelve baskets. This miracle teaches us that when we willingly place our limited resources in the Lord's hands, He can perform wonders, multiplying them to meet needs far beyond what we can imagine."
    },
    "reference": {
      "zh": "马太福音 14:13-21",
      "en": "Matthew 14:13-21"
    }
  },
  {
    "id": 9,
    "title": {
      "zh": "耶稣平静风浪",
      "en": "Jesus Calms the Storm"
    },
    "content": {
      "zh": "耶稣和门徒乘船渡海时，海上忽然起了猛烈的风暴，波浪打入船内，以致船要满了水。耶稣却在船尾安睡。门徒们惊恐万分，叫醒祂说：'老师！我们快没命了，你不在乎吗？'耶稣醒来，斥责风，又对海说：'住了吧！静了吧！'风浪就完全平息了。祂对门徒说：'为什么这样胆怯？你们还没有信心吗？'这个神迹不仅彰显了耶稣掌管自然的绝对权柄，也教导我们在人生的风暴中，要将信心建立在祂身上。",
      "en": "While Jesus and His disciples were crossing the sea by boat, a furious storm suddenly arose. The waves crashed over the boat, so that it was nearly swamped. But Jesus was in the stern, sleeping. The disciples, terrified, woke Him and cried out, 'Teacher, don't you care if we drown?' He got up, rebuked the wind and said to the waves, 'Quiet! Be still!' Then the wind died down and it was completely calm. He said to His disciples, 'Why are you so afraid? Do you still have no faith?' This miracle not only demonstrates Jesus' absolute authority over nature but also teaches us to place our faith in Him during the storms of life."
    },
    "reference": {
      "zh": "马可福音 4:35-41",
      "en": "Mark 4:35-41"
    }
  },
  {
    "id": 10,
    "title": {
      "zh": "约拿与大鱼",
      "en": "Jonah and the Great Fish"
    },
    "content": {
      "zh": "神呼召先知约拿去敌国亚述的首都尼尼微城宣告审判，约拿却违命逃跑。在海上，神兴起大风浪，约拿承认是自己的过错，被水手抛入海中。神没有任凭他死去，而是安排一条大鱼吞了他。在鱼腹中三日三夜，约拿真诚地祷告悔改。之后，神命大鱼将他吐在陆地上。约拿最终顺服前往尼尼微，全城因他的信息而悔改，免于毁灭。这个故事展示了神的普遍怜悯，以及人无法逃避神的呼召和祂那无所不在的主权。",
      "en": "God called the prophet Jonah to go to Nineveh, the capital of the enemy nation of Assyria, to proclaim judgment. Instead, Jonah disobeyed and fled. At sea, God sent a great storm. Jonah confessed his fault, and the sailors threw him overboard. God did not let him perish but arranged for a great fish to swallow him. For three days and three nights in the fish's belly, Jonah prayed sincerely in repentance. Afterward, God commanded the fish to vomit Jonah onto dry land. Jonah finally obeyed and went to Nineveh, and the entire city repented at his message, thus being spared from destruction. This story reveals God's universal mercy and illustrates that no one can escape God's call and His omnipresent sovereignty."
    },
    "reference": {
      "zh": "约拿书 1-4章",
      "en": "Jonah 1-4"
    }
  },
  {
    "id": 11,
    "title": {
      "zh": "耶稣医治瘫子",
      "en": "Jesus Heals the Paralytic"
    },
    "content": {
      "zh": "耶稣在迦百农讲道时，人群拥挤。有四个人抬着一个瘫子来，因无法靠近，他们竟拆了房顶，将瘫子连人带褥子缒到耶稣面前。耶稣看见他们非凡的信心，就对瘫子说：'小子，你的罪赦了。'这引起了宗教领袖的非议，他们认为只有神能赦罪。为证明自己有赦罪的权柄，耶稣随即对瘫子说：'起来，拿你的褥子回家去吧！'那人立刻站起来，当众行走。众人无不惊奇，归荣耀与神。这个故事有力地证明，耶稣不仅有医治身体的能力，更有赦免罪恶的权柄。",
      "en": "While Jesus was preaching in Capernaum, the crowd was so large that four men carrying a paralyzed man could not get near. So they made an opening in the roof above Jesus and lowered the man on his mat. When Jesus saw their extraordinary faith, He said to the paralytic, 'Son, your sins are forgiven.' This caused the religious leaders to grumble, thinking only God could forgive sins. To prove He had the authority to forgive sins, Jesus then said to the man, 'Get up, take your mat and go home.' Immediately, the man stood up and walked out in full view of them all. Everyone was amazed and glorified God. This story powerfully demonstrates that Jesus has not only the power to heal the body but also the authority to forgive sins."
    },
    "reference": {
      "zh": "马可福音 2:1-12",
      "en": "Mark 2:1-12"
    }
  },
  {
    "id": 12,
    "title": {
      "zh": "撒种的比喻",
      "en": "The Parable of the Sower"
    },
    "content": {
      "zh": "耶稣用一个撒种的比喻来解释天国的奥秘：种子（神的道）撒在四种土地上。路旁的被飞鸟吃尽，象征心里刚硬，道被魔鬼夺去。土浅石头地上的，发苗快，根不深，一遇患难就放弃，象征情感化、无根基的信心。荆棘地里的，被世俗的思虑和钱财的迷惑挤住，无法结实。只有落在好土里的，才能结出三十倍、六十倍、甚至一百倍的果实，象征预备好的心，能领受、持守并活出神的道。这个比喻挑战我们省察自己的心，是否是能让神的话语扎根结果的好土。",
      "en": "Jesus used the parable of the sower to explain the mystery of the kingdom of heaven: seeds (the word of God) were sown on four types of soil. Those on the path were eaten by birds, symbolizing a hardened heart from which the devil snatches the word away. Those on rocky ground sprouted quickly but withered in persecution due to shallow roots, representing an emotional, rootless faith. Those among thorns were choked by worldly worries and the deceitfulness of wealth, bearing no fruit. Only the seeds that fell on good soil produced a crop—thirty, sixty, or even a hundred times what was sown, symbolizing a prepared heart that receives, holds fast, and lives out the word of God. This parable challenges us to examine our own hearts to see if we are the good soil where God's word can take root and bear fruit."
    },
    "reference": {
      "zh": "马太福音 13:1-23",
      "en": "Matthew 13:1-23"
    }
  },
  {
    "id": 13,
    "title": {
      "zh": "耶稣复活拉撒路",
      "en": "Jesus Raises Lazarus"
    },
    "content": {
      "zh": "耶稣的朋友拉撒路病重，他的姐妹马大和马利亚派人告知耶稣。耶稣却刻意延迟，到达时拉撒路已在坟墓里四天。马大虽有信心，但仍为死亡所困。耶稣宣告了那个震撼人心真理：'复活在我，生命也在我。信我的人，虽然死了，也必复活。'祂来到墓前，大声呼叫：'拉撒路出来！'那已死的拉撒路就走了出来。这个神迹是耶稣所有神迹中最伟大的之一，不仅显明祂是生命之主，有胜过死亡的权柄，也预示了祂自己即将到来的复活。",
      "en": "Jesus's friend Lazarus was gravely ill. His sisters, Martha and Mary, sent word to Jesus. Yet, Jesus deliberately delayed His arrival until Lazarus had been in the tomb for four days. Although Martha had faith, she was still bound by the reality of death. Jesus declared the profound truth: 'I am the resurrection and the life. The one who believes in me will live, even though they die.' He went to the tomb and called in a loud voice, 'Lazarus, come out!' And the dead man came out. This miracle, one of Jesus's greatest, not only revealed Him as the Lord of life with authority over death but also foreshadowed His own impending resurrection."
    },
    "reference": {
      "zh": "约翰福音 11:1-44",
      "en": "John 11:1-44"
    }
  },
  {
    "id": 14,
    "title": {
      "zh": "保罗的归信",
      "en": "Paul's Conversion"
    },
    "content": {
      "zh": "扫罗（后来的保罗）曾是狂热的法利赛人，残酷地逼迫基督徒。在他前往大马士革捉拿信徒的路上，天上忽然有大光照耀他，他仆倒在地，听见声音说：'扫罗，你为什么逼迫我？'他问：'主啊，你是谁？'那声音回答：'我就是你所逼迫的耶稣。'这次相遇彻底改变了他。扫罗失明了三天，不吃不喝。后来神差遣门徒亚拿尼亚为他祷告，他才复明并受洗。从此，昔日的逼迫者转变为最伟大的使徒，将福音传遍外邦世界。这个故事有力地证明，神的恩典可以彻底改变任何生命，即使是最顽固的敌人。",
      "en": "Saul (later Paul) was a zealous Pharisee who cruelly persecuted Christians. On his way to Damascus to arrest believers, a great light from heaven suddenly shone around him. He fell to the ground and heard a voice say, 'Saul, why do you persecute me?' He asked, 'Who are you, Lord?' The voice replied, 'I am Jesus, whom you are persecuting.' This encounter completely transformed him. Saul was blind for three days, neither eating nor drinking. Later, God sent the disciple Ananias to pray for him, restoring his sight, and he was baptized. From then on, the former persecutor became the greatest of the apostles, spreading the gospel throughout the Gentile world. This story powerfully demonstrates that God's grace can completely transform any life, even that of the most hardened enemy."
    },
    "reference": {
      "zh": "使徒行传 9:1-19",
      "en": "Acts 9:1-19"
    }
  },
  {
    "id": 15,
    "title": {
      "zh": "耶稣受试探",
      "en": "The Temptation of Jesus"
    },
    "content": {
      "zh": "耶稣受洗后，被圣灵引到旷野，禁食四十昼夜。魔鬼趁祂饥饿时前来试探。第一次，要祂将石头变成食物，耶稣以'人活着不是单靠食物'回应。第二次，要祂从殿顶跳下以试探神的保守，耶稣以'不可试探主你的神'拒绝。第三次，要祂跪拜魔鬼以换取世上万国，耶稣斥责说'当拜主你的神，单要事奉祂'。耶稣三次都用神的话语得胜。这个故事不仅显明了耶稣完全的人性和无罪的神性，也教导我们如何倚靠神的话语来抵挡一切试探。",
      "en": "After His baptism, Jesus was led by the Spirit into the wilderness and fasted for forty days and nights. The devil came to tempt Him in His hunger. First, to turn stones into bread, Jesus responded, 'Man shall not live on bread alone.' Second, to jump from the temple's pinnacle to test God's protection, Jesus replied, 'Do not put the Lord your God to the test.' Third, to bow down to the devil for all the kingdoms of the world, Jesus rebuked, 'Worship the Lord your God, and serve him only.' Jesus triumphed in all three temptations by using the Word of God. This story reveals Jesus' perfect humanity and sinless divinity, and teaches us how to rely on God's Word to overcome all temptations."
    },
    "reference": {
      "zh": "马太福音 4:1-11",
      "en": "Matthew 4:1-11"
    }
  },
  {
    "id": 16,
    "title": {
      "zh": "以利亚与巴力先知",
      "en": "Elijah and the Prophets of Baal"
    },
    "content": {
      "zh": "在以色列灵性黑暗的时代，先知以利亚独自挑战信奉假神巴力的450个先知。在迦密山上，他提议双方各献一牛，求自己的神降火焚烧祭物。巴力的先知狂呼乱舞，自残己身，却毫无回应。轮到以利亚时，他重修耶和华的坛，倒水浸透祭物，然后简单祷告。神迹立时发生，天降大火，烧尽一切。百姓看见便俯伏在地，承认'耶和华是神！'这个故事彰显了独一真神的绝对大能，以及在悖逆时代中，忠心仆人靠信心站立的力量。",
      "en": "In a time of spiritual darkness in Israel, the prophet Elijah single-handedly challenged 450 prophets of the false god Baal. On Mount Carmel, he proposed a contest: each side would prepare a sacrifice, and the god who answered with fire would be proven true. The prophets of Baal cried out, danced, and cut themselves, but there was no response. When it was Elijah's turn, he repaired the Lord's altar, drenched the sacrifice with water, and offered a simple prayer. Immediately, fire fell from heaven and consumed everything. Seeing this, the people fell on their faces and confessed, 'The LORD—he is God!' This story magnificently displays the absolute power of the one true God and the strength of a faithful servant standing by faith in a rebellious age."
    },
    "reference": {
      "zh": "列王纪上 18:20-40",
      "en": "1 Kings 18:20-40"
    }
  },
  {
    "id": 17,
    "title": {
      "zh": "约书亚和耶利哥城",
      "en": "Joshua and Jericho"
    },
    "content": {
      "zh": "以色列人进入应许之地，第一场战役便是攻打坚不可摧的耶利哥城。神赐给约书亚的作战计划并非军事策略，而是一套看似不合逻辑的仪式：每日绕城一次，连续六天；第七日绕城七次，然后祭司吹响羊角，全体百姓大声呼喊。以色列人完全顺服，当第七日的呼喊声响起时，耶利哥的城墙应声塌陷。这个故事生动地教导我们，属灵的胜利不依赖人的智慧或力量，而在于对神命令的绝对顺服和信心。",
      "en": "As the Israelites entered the Promised Land, their first battle was against the impregnable city of Jericho. The battle plan God gave to Joshua was not a military strategy but a seemingly illogical ritual: march around the city once a day for six days, and on the seventh day, march around it seven times, after which the priests would blow their horns and all the people would shout. The Israelites obeyed completely, and as their shout rang out on the seventh day, the walls of Jericho collapsed. This story vividly teaches that spiritual victory depends not on human wisdom or strength, but on absolute obedience and faith in God's commands."
    },
    "reference": {
      "zh": "约书亚记 6章",
      "en": "Joshua 6"
    }
  },
  {
    "id": 18,
    "title": {
      "zh": "路得的忠诚",
      "en": "Ruth's Loyalty"
    },
    "content": {
      "zh": "在士师秉政的混乱时代，摩押女子路得在丈夫死后，没有选择回到自己的家乡，而是选择忠诚地跟随她同样失去丈夫和儿子的婆婆拿俄米，回到陌生的伯利恒。她那句'你的国就是我的国，你的神就是我的神'的宣告，成为忠诚与委身的千古名言。因着她的信实与贤德，神引导她遇到了亲族波阿斯，并最终嫁给他，成为大卫王乃至耶稣基督的先祖。这个美丽的故事展示了在困境中持守忠诚的宝贵，以及神如何眷顾和奖赏那些投靠在祂翅膀荫下的人。",
      "en": "During the chaotic time of the judges, the Moabite woman Ruth, after the death of her husband, chose not to return to her homeland but to loyally follow her mother-in-law Naomi, who had also lost her husband and sons, back to the unfamiliar land of Bethlehem. Her declaration, 'Your people will be my people and your God my God,' has become a timeless expression of loyalty and commitment. Because of her faithfulness and virtue, God led her to her kinsman Boaz, whom she eventually married, becoming an ancestor of King David and Jesus Christ. This beautiful story showcases the value of remaining loyal in hardship and how God provides for and rewards those who take refuge under His wings."
    },
    "reference": {
      "zh": "路得记 1-4章",
      "en": "Ruth 1-4"
    }
  },
  {
    "id": 19,
    "title": {
      "zh": "以斯帖拯救犹太人",
      "en": "Esther Saves the Jews"
    },
    "content": {
      "zh": "在波斯帝国，犹太女子以斯帖被选为王后。当时，宰相哈曼图谋灭绝所有犹太人。以斯帖的养父末底改鼓励她挺身而出，说出了那句著名的话：'焉知你得了王后的位分，不是为现今的机会吗？'以斯帖冒着生命危险，以'死就死吧'的决心违例去见国王，并以她的智慧揭露了哈曼的阴谋。最终，哈曼被处死，犹太民族得以拯救。这个故事彰显了神的隐藏护理，祂在历史中掌权，并呼召祂的子民在关键时刻勇敢地承担使命。",
      "en": "In the Persian Empire, a Jewish woman named Esther was chosen as queen. At that time, the prime minister, Haman, plotted to exterminate all Jews. Esther's foster father, Mordecai, encouraged her to intervene, speaking the famous words, 'And who knows but that you have come to your royal position for such a time as this?' Risking her life with the resolve 'If I perish, I perish,' Esther went before the king unsummoned and, with wisdom, exposed Haman's plot. In the end, Haman was executed, and the Jewish people were saved. This story highlights God's hidden providence, showing He is sovereign in history and calls His people to act courageously in critical moments to fulfill their mission."
    },
    "reference": {
      "zh": "以斯帖记 1-10章",
      "en": "Esther 1-10"
    }
  },
  {
    "id": 20,
    "title": {
      "zh": "耶稣与撒玛利亚妇人",
      "en": "Jesus and the Samaritan Woman"
    },
    "content": {
      "zh": "耶稣在雅各井旁，主动与一位撒玛利亚妇人交谈，打破了当时深刻的种族与性别隔阂。祂向她启示'活水'的奥秘，指出人内心真正的干渴，并温柔地揭示了她过往的伤痛。耶稣教导她说，真正的敬拜是'用心灵和诚实'，而非拘泥于地点。这次相遇让妇人认出耶稣是弥赛亚，她兴奋地回城作见证，使许多人因此信了主。这个故事完美地展示了福音如何跨越一切障碍，触及并改变每一个寻求真理的灵魂。",
      "en": "At Jacob's well, Jesus initiated a conversation with a Samaritan woman, breaking the deep racial and gender barriers of the time. He revealed to her the mystery of 'living water,' addressing the true thirst of the human heart, and gently exposed her past pains. Jesus taught her that true worship is 'in spirit and in truth,' not confined to a physical location. This encounter led the woman to recognize Jesus as the Messiah. She excitedly returned to her town to testify, leading many to believe in the Lord. This story perfectly illustrates how the Gospel transcends all barriers to touch and transform every soul that seeks the truth."
    },
    "reference": {
      "zh": "约翰福音 4:1-42",
      "en": "John 4:1-42"
    }
  },
  {
    "id": 21,
    "title": {
      "zh": "创造的故事",
      "en": "The Story of Creation"
    },
    "content": {
      "zh": "在起初，神用六天创造了天地万物。祂说有光，就有了光；祂分开水，造出天空和陆地；祂使地生长植物，造出日月星辰，又造了各类飞鸟走兽。每造一样，神都看为是好的。在第六天，神按着自己的形象造了人，亚当和夏娃，并赐予他们管理全地的权柄。第七天，神歇了祂一切的工，安息了，并赐福给这一日。这个故事揭示了神是万物的创造者，祂的创造充满秩序、美善和目的，而人类是祂创造的顶峰，享有特殊的地位。",
      "en": "In the beginning, God created the heavens and the earth in six days. He spoke, and there was light; He separated the waters to form the sky and the land; He made the earth bring forth vegetation, created the sun, moon, and stars, and filled the world with birds and animals of every kind. After each act of creation, God saw that it was good. On the sixth day, God created man, Adam and Eve, in His own image, and gave them dominion over all the earth. On the seventh day, God rested from all His work and blessed it. This story reveals that God is the Creator of all things, His creation is orderly, good, and purposeful, and humanity is the pinnacle of His creation, holding a special place."
    },
    "reference": {
      "zh": "创世记 1-2章",
      "en": "Genesis 1-2"
    }
  },
  {
    "id": 22,
    "title": {
      "zh": "人类的堕落",
      "en": "The Fall of Man"
    },
    "content": {
      "zh": "在伊甸园中，蛇（魔鬼）引诱夏娃，质疑并扭曲神的话语，让她吃了神唯一禁止的分别善恶树上的果子。夏娃又把果子给了亚当，他也吃了。他们的眼睛立刻明亮了，意识到自己赤身露体，便心生羞愧和恐惧，躲避神。这次悖逆的行为被称为'堕落'，它使罪和死亡进入了世界，破坏了人与神、人与人以及人与自然之间的和谐关系。然而，神在审判中也应许了第一道救赎的曙光。",
      "en": "In the Garden of Eden, the serpent (the devil) tempted Eve by questioning and distorting God's word, leading her to eat the fruit from the tree of the knowledge of good and evil, the only one God had forbidden. Eve then gave the fruit to Adam, who also ate it. Their eyes were immediately opened; they realized their nakedness and felt shame and fear, hiding from God. This act of disobedience, known as 'the Fall,' brought sin and death into the world, breaking the harmonious relationship between God and humanity, between people, and between humanity and nature. Yet, in the midst of judgment, God also gave the first glimmer of a promise of redemption."
    },
    "reference": {
      "zh": "创世记 3章",
      "en": "Genesis 3"
    }
  },
  {
    "id": 23,
    "title": {
      "zh": "巴别塔",
      "en": "The Tower of Babel"
    },
    "content": {
      "zh": "洪水之后，全地的人类说同一种语言。他们聚集在示拿地，决定建造一座城和一座通天的塔，为要传扬自己的名，免得分散在全地上。他们的动机是骄傲和自我荣耀，企图以人的力量与神抗衡。神看穿了他们的意图，便变乱了他们的口音，使他们言语不通，无法协作。于是，他们停工分散到世界各地。这个故事解释了世上多种语言的由来，并警示我们，人的骄傲和悖逆终将导致混乱和分散。",
      "en": "After the flood, all the people of the earth spoke the same language. They gathered in the land of Shinar and decided to build a city and a tower reaching to the heavens, in order to make a name for themselves and avoid being scattered across the earth. Their motive was pride and self-glorification, an attempt to rival God through human strength. God saw their intentions and confused their language, so they could no longer understand each other and work together. Consequently, they stopped their work and were scattered throughout the world. This story explains the origin of the world's diverse languages and serves as a warning that human pride and rebellion ultimately lead to confusion and division."
    },
    "reference": {
      "zh": "创世记 11:1-9",
      "en": "Genesis 11:1-9"
    }
  },
  {
    "id": 24,
    "title": {
      "zh": "十诫",
      "en": "The Ten Commandments"
    },
    "content": {
      "zh": "在西奈山上，神亲自向摩西颁布了十条诫命。这十诫是神与以色列人所立之约的核心。前四条关乎人对神的敬畏和爱，如'除我以外，你不可有别的神'和'当记念安息日，守为圣日'。后六条则关乎人与人之间的道德关系，如'当孝敬父母'，以及不可杀人、不可奸淫、不可偷盗等。十诫不仅是古代以色列的法律基础，也构成了普世的道德和伦理准则，深刻地揭示了神圣洁和公义的属性。",
      "en": "On Mount Sinai, God personally gave Moses the Ten Commandments. These ten laws are the core of the covenant God made with the people of Israel. The first four concern reverence and love for God, such as 'You shall have no other gods before me' and 'Remember the Sabbath day by keeping it holy.' The remaining six address moral relationships between people, including 'Honor your father and your mother,' and prohibitions against murder, adultery, and theft. The Ten Commandments are not only the legal foundation for ancient Israel but also form a universal code of morality and ethics, profoundly revealing God's holy and righteous character."
    },
    "reference": {
      "zh": "出埃及记 20:1-17",
      "en": "Exodus 20:1-17"
    }
  },
  {
    "id": 25,
    "title": {
      "zh": "参孙与大利拉",
      "en": "Samson and Delilah"
    },
    "content": {
      "zh": "参孙是神所拣选的士师，从出生起就分别为圣，拥有神赐的超人力量，这力量的记号在于他未被剃过的头发。他多次重创非利士人，但也在个人品德上屡次失败，尤其沉迷于女色。非利士首领利用妇人大利拉，诱使参孙说出力量的秘密。在参孙熟睡时，大利拉剃掉他的头发，使他失去力量，被非利士人擒获、剜去双眼。在生命最后一刻，参孙悔改，求神再次赐予力量，最终与众多非利士人同归于尽。他的故事是一个关于恩赐、诱惑与悲剧性悔改的深刻警示。",
      "en": "Samson was a judge chosen by God, set apart as a Nazirite from birth, possessing superhuman strength symbolized by his uncut hair. He inflicted heavy losses on the Philistines but repeatedly failed in personal character, especially in his weakness for women. The Philistine rulers used a woman, Delilah, to entice Samson into revealing the secret of his strength. While he slept, Delilah had his hair shaved, causing him to lose his power. He was then captured and blinded by the Philistines. In the final moments of his life, Samson repented and prayed for strength one last time, ultimately bringing down a temple and dying with a multitude of Philistines. His story is a profound warning about spiritual gifts, temptation, and tragic repentance."
    },
    "reference": {
      "zh": "士师记 13-16章",
      "en": "Judges 13-16"
    }
  },
  {
    "id": 26,
    "title": {
      "zh": "火窑中的三个朋友",
      "en": "The Three Friends in the Fiery Furnace"
    },
    "content": {
      "zh": "在巴比伦，尼布甲尼撒王立了一个巨大的金像，命令所有臣民跪拜。但以理的三个朋友，沙得拉、米煞、亚伯尼歌，坚决不拜偶像，只敬拜独一的真神。国王大怒，将他们扔进比平时烈七倍的火窑中。然而，神迹发生了，国王看见窑中有四个人，其中一位'相貌好像神子'，三人在火中毫发无损。国王将他们救出，并因此降旨颂赞这位能施行大拯救的神。这个故事展现了在信仰压迫面前，坚贞不屈的信心所带来的神迹与荣耀。",
      "en": "In Babylon, King Nebuchadnezzar erected a giant golden statue and commanded all his subjects to worship it. Daniel's three friends, Shadrach, Meshach, and Abednego, refused to bow down to the idol, remaining faithful to the one true God. The enraged king had them thrown into a furnace heated seven times hotter than usual. However, a miracle occurred: the king saw four men walking unharmed in the fire, and the fourth 'looked like a son of the gods.' The king brought them out and issued a decree praising the God who could perform such a great deliverance. This story demonstrates the miraculous and glorious results of unwavering faith in the face of religious persecution."
    },
    "reference": {
      "zh": "但以理书 3章",
      "en": "Daniel 3"
    }
  },
  {
    "id": 27,
    "title": {
      "zh": "耶稣的降生",
      "en": "The Birth of Jesus"
    },
    "content": {
      "zh": "在罗马皇帝凯撒亚古士督颁布人口普查令时，木匠约瑟带着已许配给他、因圣灵感孕的童贞女马利亚，回到伯利恒。因客店没有地方，马利亚在马槽里生下了耶稣。当夜，有天使向野地的牧羊人显现，宣告救主基督的降生，并将这大喜的信息传给他们。同时，有东方的博士（智者）观察到一颗特别的星，不远万里前来朝拜这位新生王。耶稣的降生，是神道成肉身，进入人类历史的开始，是神对世界最伟大的爱的彰显。",
      "en": "During a census decreed by Caesar Augustus, a carpenter named Joseph traveled to Bethlehem with Mary, his betrothed, who was a virgin pregnant through the Holy Spirit. Because there was no room in the inn, Mary gave birth to Jesus in a manger. That night, an angel appeared to shepherds in the fields, announcing the birth of the Savior, Christ the Lord, and bringing them this message of great joy. Meanwhile, wise men (Magi) from the East observed a special star and traveled a great distance to worship the newborn King. The birth of Jesus marks the beginning of God becoming flesh and entering human history, the greatest demonstration of God's love for the world."
    },
    "reference": {
      "zh": "路加福音 2:1-20",
      "en": "Luke 2:1-20"
    }
  },
  {
    "id": 28,
    "title": {
      "zh": "耶稣的受难与复活",
      "en": "The Crucifixion and Resurrection of Jesus"
    },
    "content": {
      "zh": "耶稣被门徒犹大出卖，被捕后遭受不公的审判，并被判钉十字架。祂在各各他山上被钉死，承担了世人的罪。祂死后被安葬在坟墓里。然而，第三天，几位妇女去坟墓时发现坟墓是空的，天使向她们显现，宣告耶稣已经复活。复活的基督多次向门徒显现，证明祂已战胜死亡。这是基督教信仰的核心，显明了神的救赎大爱和赐给信徒永生的盼望。",
      "en": "Betrayed by his disciple Judas, Jesus was arrested, subjected to an unjust trial, and sentenced to be crucified. He was crucified on Calvary Hill, bearing the sins of the world. After His death, He was buried in a tomb. However, on the third day, several women who went to the tomb found it empty. An angel appeared to them, declaring that Jesus had risen. The resurrected Christ appeared multiple times to His disciples, proving He had conquered death. This is the core of the Christian faith, demonstrating God's redemptive love and the hope of eternal life for believers."
    },
    "reference": {
      "zh": "路加福音 23-24章",
      "en": "Luke 23-24"
    }
  },
  {
    "id": 29,
    "title": {
      "zh": "最后的晚餐",
      "en": "The Last Supper"
    },
    "content": {
      "zh": "在被钉十字架的前夜，耶稣与十二门徒一同吃逾越节的晚餐。席间，祂设立了圣餐：拿起饼祝谢了，擘开递给门徒说'这是我的身体'；又拿起杯祝谢了，递给他们说'这是我立约的血，为多人流出来，使罪得赦'。祂以此来预示自己即将为世人的罪而献身。同时，祂也预言了犹大的出卖和彼得的三次不认主，并赐下彼此相爱的新命令。这顿晚餐成为教会纪念主的核心礼仪之一。",
      "en": "On the night before His crucifixion, Jesus shared the Passover meal with His twelve disciples. During the supper, He instituted the Holy Communion: He took bread, gave thanks, broke it, and gave it to them, saying, 'This is my body.' He then took the cup, gave thanks, and offered it to them, saying, 'This is my blood of the covenant, which is poured out for many for the forgiveness of sins.' He used this to signify His imminent sacrifice for the sins of the world. He also foretold Judas's betrayal and Peter's three denials, and gave a new commandment to love one another. This supper has become one of the central sacraments for the Church to remember the Lord."
    },
    "reference": {
      "zh": "马太福音 26:17-30",
      "en": "Matthew 26:17-30"
    }
  },
  {
    "id": 30,
    "title": {
      "zh": "五旬节圣灵降临",
      "en": "The Coming of the Holy Spirit at Pentecost"
    },
    "content": {
      "zh": "耶稣升天后，门徒们聚集在耶路撒冷祷告。到了五旬节那天，忽然有响声如大风吹过，充满了他们所在的屋子，又有火焰般的舌头显现，分别落在各人头上。他们就都被圣灵充满，按着圣灵所赐的口才说起别国的话来。彼得站起来向众人讲道，有力地见证耶稣的复活，当天就有三千人悔改信主并受洗。这一天标志着基督教会的诞生，圣灵时代的开始，福音将从耶路撒冷传向地极。",
      "en": "After Jesus's ascension, the disciples gathered in Jerusalem to pray. On the day of Pentecost, a sound like the blowing of a violent wind came from heaven and filled the whole house where they were sitting. They saw what seemed to be tongues of fire that separated and came to rest on each of them. All of them were filled with the Holy Spirit and began to speak in other tongues as the Spirit enabled them. Peter stood up and preached to the crowd, powerfully testifying to Jesus's resurrection, and that day about three thousand people repented, believed, and were baptized. This day marks the birth of the Christian Church and the beginning of the age of the Holy Spirit, signaling that the gospel would spread from Jerusalem to the ends of the earth."
    },
    "reference": {
      "zh": "使徒行传 2章",
      "en": "Acts 2"
    }
  }
]